[
  {
    "id": "medecine",
    "name": "Médecine",
    "slug": "medecine",
    "category": "Sciences de la Santé",
    "description": "La médecine est une science et une pratique étudiant l'organisation du corps humain, son fonctionnement normal, et cherchant à le maintenir en bonne santé par la prévention et le traitement des pathologies. Cette formation exigeante forme des professionnels de santé capables de diagnostiquer, traiter et prévenir les maladies. Les étudiants en médecine acquièrent une solide base scientifique en anatomie, physiologie, pathologie, pharmacologie et développent des compétences cliniques essentielles. Le cursus comprend des stages pratiques en hôpital permettant d'appliquer les connaissances théoriques dans un environnement réel. Les futurs médecins apprennent également l'éthique médicale, la communication avec les patients et le travail en équipe pluridisciplinaire. Cette filière demande de la rigueur, de l'empathie et une capacité d'adaptation constante face aux évolutions technologiques et scientifiques du domaine médical.",
    "duration": "7 ans",
    "careerOpportunities": ["Médecin généraliste", "Médecin spécialiste", "Chirurgien", "Urgentiste", "Pédiatre"],
    "averageSalary": "500,000 - 2,000,000 FCFA",
    "requiredSkills": ["Empathie", "Résistance au stress", "Précision", "Travail d'équipe", "Formation continue"],
    "universities": ["uac", "uniab", "uac-parakou"],
    "image": "/images/filieres/medecine.jpg"
  },
  {
    "id": "droit",
    "name": "Droit",
    "slug": "droit",
    "category": "Sciences Humaines",
    "description": "Le droit est l'ensemble des règles qui régissent la conduite des personnes, des groupes et des institutions au sein d'une société donnée. Cette formation développe chez les étudiants une pensée juridique rigoureuse et une capacité d'analyse des textes législatifs et réglementaires. Les futurs juristes étudient les différentes branches du droit : civil, pénal, administratif, commercial, international. Ils apprennent à maîtriser la recherche juridique, la rédaction d'actes et de mémoires, ainsi que l'art de la plaidoirie. La formation inclut également l'étude de la procédure, de la déontologie et de l'évolution constante du droit dans un contexte national et international. Les diplômés peuvent exercer comme avocats, magistrats, juristes d'entreprise ou dans l'administration publique, contribuant ainsi à l'application et à l'évolution du système juridique.",
    "duration": "4 ans",
    "careerOpportunities": ["Avocat", "Juge", "Magistrat", "Juriste d'entreprise", "Notaire", "Huissier"],
    "averageSalary": "300,000 - 800,000 FCFA",
    "requiredSkills": ["Argumentation", "Rédaction", "Analyse", "Éloquence", "Rigueur"],
    "universities": ["uac"],
    "image": "/images/filieres/droit.jpg"
  },
  {
    "id": "informatique",
    "name": "Informatique",
    "slug": "informatique",
    "category": "Sciences et Technologies",
    "description": "L'informatique est un domaine d'activité scientifique, technique et industriel concernant le traitement automatique de l'information numérique par l'exécution de programmes informatiques. Cette filière en pleine expansion forme des professionnels capables de concevoir, développer et maintenir des systèmes informatiques. Les étudiants apprennent plusieurs langages de programmation, les bases de données, les réseaux, la cybersécurité et l'intelligence artificielle. La formation couvre aussi bien les aspects théoriques (algorithmique, mathématiques appliquées) que pratiques (développement d'applications, gestion de projets). Les futurs informaticiens développent des compétences en résolution de problèmes, en travail collaboratif et en veille technologique constante. Cette filière offre de nombreuses spécialisations : développement web/mobile, data science, cybersécurité, intelligence artificielle, permettant aux diplômés de s'adapter aux besoins évolutifs du marché numérique.",
    "duration": "3-5 ans",
    "careerOpportunities": ["Développeur web", "Ingénieur logiciel", "Data scientist", "Cybersécurité", "Chef de projet IT"],
    "averageSalary": "400,000 - 1,200,000 FCFA",
    "requiredSkills": ["Logique", "Résolution de problèmes", "Créativité", "Travail d'équipe", "Veille technologique"],
    "universities": ["uac", "uniab"],
    "image": "/images/filieres/informatique.jpg"
  },
  {
    "id": "genie-civil",
    "name": "Génie Civil",
    "slug": "genie-civil",
    "category": "Ingénierie",
    "description": "Le génie civil représente l'ensemble des techniques de construction civile. Il comprend la conception, la réalisation, l'exploitation et la réhabilitation d'ouvrages de construction. Cette formation d'ingénieur développe des compétences en mathématiques appliquées, résistance des matériaux, mécanique des sols et gestion de projets. Les étudiants apprennent à concevoir des infrastructures durables : ponts, routes, bâtiments, réseaux d'assainissement. La formation inclut l'utilisation de logiciels de CAO/DAO, la maîtrise des normes de construction et des règlements de sécurité. Les futurs ingénieurs développent également des compétences en management d'équipes, planification de chantiers et contrôle qualité. Cette filière prépare à des responsabilités importantes dans la transformation du cadre de vie et le développement des infrastructures nationales.",
    "duration": "5 ans",
    "careerOpportunities": ["Ingénieur BTP", "Chef de chantier", "Bureau d'études", "Contrôleur technique", "Entrepreneur"],
    "averageSalary": "450,000 - 1,000,000 FCFA",
    "requiredSkills": ["Calcul", "Gestion de projet", "Leadership", "Sécurité", "Innovation"],
    "universities": ["uniab"],
    "image": "/images/filieres/genie-civil.jpg"
  },
  {
    "id": "agriculture",
    "name": "Agriculture",
    "slug": "agriculture",
    "category": "Sciences Agricoles",
    "description": "L'agriculture est l'art de cultiver la terre afin de produire des végétaux et d'élever des animaux utiles à l'être humain. Cette formation moderne couvre l'agronomie, la zootechnie, l'agroécologie et les nouvelles technologies agricoles. Les étudiants apprennent les techniques de production durable, la gestion des ressources naturelles, la protection phytosanitaire et l'amélioration génétique. La formation inclut aussi l'agro-business, la transformation des produits agricoles et les circuits de commercialisation. Les futurs agronomes développent des compétences en innovation agricole, agriculture de précision et développement rural. Cette filière répond aux enjeux contemporains de sécurité alimentaire, de développement durable et de modernisation de l'agriculture béninoise.",
    "duration": "3-4 ans",
    "careerOpportunities": ["Ingénieur agronome", "Conseiller agricole", "Chef d'exploitation", "Technicien agricole"],
    "averageSalary": "250,000 - 600,000 FCFA",
    "requiredSkills": ["Observation", "Patience", "Innovation", "Gestion", "Écologie"],
    "universities": ["ub"],
    "image": "/images/filieres/agriculture.jpg"
  },
  {
    "id": "economie",
    "name": "Économie",
    "slug": "economie",
    "category": "Sciences Économiques",
    "description": "L'économie est une science sociale qui étudie la production, la répartition, la distribution et la consommation des richesses d'une société. Cette formation développe une compréhension approfondie des mécanismes économiques, de la macroéconomie et de la microéconomie. Les étudiants maîtrisent l'analyse statistique, l'économétrie et les modèles de prévision économique. La formation couvre également l'économie du développement, les finances publiques, l'économie internationale et l'économie numérique. Les futurs économistes apprennent à analyser les politiques publiques, évaluer les investissements et conseiller les décideurs. Cette filière prépare à des carrières dans la recherche, les institutions financières, les organisations internationales et le conseil en stratégie économique.",
    "duration": "3-5 ans",
    "careerOpportunities": ["Économiste", "Analyste financier", "Conseiller en investissement", "Banquier", "Consultant"],
    "averageSalary": "350,000 - 900,000 FCFA",
    "requiredSkills": ["Analyse", "Statistiques", "Communication", "Logique", "Esprit de synthèse"],
    "universities": ["uac"],
    "image": "/images/filieres/economie.jpg"
  }
]